 // 1.Выведите в консоль результат деления числа 100 на 4.

 let result = 100 / 4;
 console.log(result);
 // ========================================================================
 
 // 2.Реализуйте программу, которая вычисляет и выводит на экран значение выражения: 8 / 2 + 5 - -3 / 2
 let num = 8 / 2 + 5 - -3 / 2;
 console.log(num);  
 // ==========================================================================
 
 // 3.Выведите в консоль следующую фразу, используя конкатенацию: Lorem ipsum dolor sit amet
 
 let string = 'Lorem ' + 'ipsum ' + 'dolor ' + 'sit ' + 'amet';
 console.log(string); 
 // ============================================================================
 
 // 4.Выведите фразу из предыдущего задания в консоль, используя интерполяцию.
 
 let string1 = `Lorem ipsum dolor sit amet`;
 console.log(string1); 
 // ============================================================================
 
 // 5.Создайте переменную number и присвойте ей значение 8. Затем переопределите значение - задайте новое значение 15. Выведите новое значение переменной в консоль.
 
 let number = 8;
 number = 15;
 console.log(number); 
 // ==============================================================================
 
 // 6.Создайте переменную sum, которая будет выполнять операцию возведения в квадрат числа 8. Выведите переменную sum в консоль.
 
 let sum = 8 ** 2;
 console.log(sum);   
 // ============================================================================
 
 // 7.Создайте две переменные name и lastname. Присвойте им произвольные значения. Выведите в консоль строку в формате ‘Имя Фамилия’
 
 let name = 'Madina';
 let lastname = 'Mel';
 console.log(`${name} ${lastname}`);
 // =========================================================================
 
 let firstName = 'Oleg';
 let lastName = 'Orlov';
 
 let string2 = 'His name is ' + firstName + ' ' + lastName; // konkatenatsiya
 
 let string3 = `His name is ${firstName} ${lastName}`; // interpolyatsiya
 
 console.log(string2);
 console.log(string3);