/* Создать форму, с восемью инпутами (имя, фамилия, возраст, ставка, дни, email, ссылка на фото, прогресс)
При отправке формы собрать данные из инпутов и записать их в пустой массив workers в виде объекта (в формате ключ-значение).
Используя данные из массива workers, сформировать под формой карточку со следующей информацией:
Name: ИМЯ ФАМИЛИЯ
Age: ВОЗРАСТ
Salary: СТАВКА * ДНИ
EMAIL (*кликабельный)
ФОТО (*отображается фото)
ЛИНИЯ ПРОГРЕССА (*контейнер прогресса наполнен в соответствии со значением, переданным в инпут)
Каждый раз после отправки формы очищать инпуты
Карточке и форме добавить стили на выбор */